bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/spi_reg.h
/* 0xFC : backup_io_en */
#define SPI_BACKUP_IO_EN_OFFSET (0xFC)
#define SPI_BACKUP_IO_EN        SPI_BACKUP_IO_EN
#define SPI_BACKUP_IO_EN_POS    (0U)
#define SPI_BACKUP_IO_EN_LEN    (1U)
#define SPI_BACKUP_IO_EN_MSK    (((1U << SPI_BACKUP_IO_EN_LEN) - 1) << SPI_BACKUP_IO_EN_POS)
#define SPI_BACKUP_IO_EN_UMSK   (~(((1U << SPI_BACKUP_IO_EN_LEN) - 1) << SPI_BACKUP_IO_EN_POS))

struct spi_reg {
    /* 0x0 : spi_config */
    union {
        struct {
            uint32_t cr_spi_m_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_spi_s_en        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_spi_frame_size  : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t cr_spi_sclk_pol    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_spi_sclk_ph     : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_spi_bit_inv     : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_spi_byte_inv    : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_spi_rxd_ignr_en : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_spi_m_cont_en   : 1;  /* [    9],        r/w,        0x0 */
            uint32_t cr_spi_s_3pin_mode : 1;  /* [   10],        r/w,        0x0 */
            uint32_t cr_spi_deg_en      : 1;  /* [   11],        r/w,        0x0 */
            uint32_t cr_spi_deg_cnt     : 4;  /* [15:12],        r/w,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_config;

    /* 0x4 : spi_int_sts */
    union {
        struct {
            uint32_t spi_end_int     : 1; /* [    0],          r,        0x0 */
            uint32_t spi_txf_int     : 1; /* [    1],          r,        0x1 */
            uint32_t spi_rxf_int     : 1; /* [    2],          r,        0x0 */
            uint32_t spi_sto_int     : 1; /* [    3],          r,        0x0 */
            uint32_t spi_txu_int     : 1; /* [    4],          r,        0x0 */
            uint32_t spi_fer_int     : 1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_7    : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cr_spi_end_mask : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_spi_txf_mask : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_spi_rxf_mask : 1; /* [   10],        r/w,        0x1 */
            uint32_t cr_spi_sto_mask : 1; /* [   11],        r/w,        0x1 */
            uint32_t cr_spi_txu_mask : 1; /* [   12],        r/w,        0x1 */
            uint32_t cr_spi_fer_mask : 1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_15  : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t cr_spi_end_clr  : 1; /* [   16],        w1c,        0x0 */
            uint32_t rsvd_17         : 1; /* [   17],       rsvd,        0x0 */
            uint32_t rsvd_18         : 1; /* [   18],       rsvd,        0x0 */
            uint32_t cr_spi_sto_clr  : 1; /* [   19],        w1c,        0x0 */
            uint32_t cr_spi_txu_clr  : 1; /* [   20],        w1c,        0x0 */
            uint32_t rsvd_21         : 1; /* [   21],       rsvd,        0x0 */
            uint32_t reserved_22_23  : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t cr_spi_end_en   : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_spi_txf_en   : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_spi_rxf_en   : 1; /* [   26],        r/w,        0x1 */
            uint32_t cr_spi_sto_en   : 1; /* [   27],        r/w,        0x1 */
            uint32_t cr_spi_txu_en   : 1; /* [   28],        r/w,        0x1 */
            uint32_t cr_spi_fer_en   : 1; /* [   29],        r/w,        0x1 */
            uint32_t reserved_30_31  : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_int_sts;

    /* 0x8 : spi_bus_busy */
    union {
        struct {
            uint32_t sts_spi_bus_busy : 1;  /* [    0],          r,        0x0 */
            uint32_t reserved_1_31    : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_bus_busy;

    /* 0xc  reserved */
    uint8_t RESERVED0xc[4];

    /* 0x10 : spi_prd_0 */
    union {
        struct {
            uint32_t cr_spi_prd_s      : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t cr_spi_prd_p      : 8; /* [15: 8],        r/w,        0xf */
            uint32_t cr_spi_prd_d_ph_0 : 8; /* [23:16],        r/w,        0xf */
            uint32_t cr_spi_prd_d_ph_1 : 8; /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } spi_prd_0;

    /* 0x14 : spi_prd_1 */
    union {
        struct {
            uint32_t cr_spi_prd_i  : 8;  /* [ 7: 0],        r/w,        0xf */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_prd_1;

    /* 0x18 : spi_rxd_ignr */
    union {
        struct {
            uint32_t cr_spi_rxd_ignr_p : 5;  /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_15     : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t cr_spi_rxd_ignr_s : 5;  /* [20:16],        r/w,        0x0 */
            uint32_t reserved_21_31    : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_rxd_ignr;

    /* 0x1C : spi_sto_value */
    union {
        struct {
            uint32_t cr_spi_sto_value : 12; /* [11: 0],        r/w,      0xfff */
            uint32_t reserved_12_31   : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_sto_value;

    /* 0x20  reserved */
    uint8_t RESERVED0x20[96];

    /* 0x80 : spi_fifo_config_0 */
    union {
        struct {
            uint32_t spi_dma_tx_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t spi_dma_rx_en     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_fifo_config_0;

    /* 0x84 : spi_fifo_config_1 */
    union {
        struct {
            uint32_t tx_fifo_cnt    : 5; /* [ 4: 0],          r,       0x10 */
            uint32_t reserved_5_7   : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rx_fifo_cnt    : 5; /* [12: 8],          r,        0x0 */
            uint32_t reserved_13_15 : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t tx_fifo_th     : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reserved_20_23 : 4; /* [23:20],       rsvd,        0x0 */
            uint32_t rx_fifo_th     : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_fifo_config_1;

    /* 0x88 : spi_fifo_wdata */
    union {
        struct {
            uint32_t spi_fifo_wdata : 32; /* [31: 0],          w,          x */
        } BF;
        uint32_t WORD;
    } spi_fifo_wdata;

    /* 0x8C : spi_fifo_rdata */
    union {
        struct {
            uint32_t spi_fifo_rdata : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_fifo_rdata;

    /* 0x90  reserved */
    uint8_t RESERVED0x90[108];

    /* 0xFC : backup_io_en */
    union {
        struct {
            uint32_t backup_io_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } backup_io_en;
};

typedef volatile struct spi_reg spi_reg_t;

#endif /* __SPI_REG_H__ */
